from Variables.variable import *

shop_sell_list = {'青铜剑': ['隔壁打铁铺使用上好青铜制作', 30, 0], '青铜头盔': ['虽然青铜质脆，但该有的防具还是要有的', 10, 1],
                  '青铜甲': ['虽然青铜质脆，但该有的防具还是要有的', 30, 2],
                  '青铜护腿': ['虽然青铜质脆，但该有的防具还是要有的', 15, 3], '青铜靴': ['虽然青铜质脆，但该有的防具还是要有的', 10, 4],
                  '五品金疮药': ['在这种偏远的小镇，只能买到这种等级的金创药了', 20, 5], '四品金疮药': ['在这种偏远的地区，这可算是无价之宝了', 100, 6]}

shop_recycle_list = {'狼肉': ['这附近经常有野狼出没，这东西很便宜', 5 * inflation], '野猪肉': ['野猪不同于家猪，肉质更有嚼劲', 8 * inflation],
                     '蜥蜴肉': ['蜥蜴个小，肉少，但很香', 10 * inflation],
                     '蛇肉': ['蛇肉可以入药，许多中药都有蛇肉', 6 * inflation], '蛇胆': ['很稀有的药材，清热解毒', 15 * inflation]}

# sell    为商店售卖菜单
# recycle 为商店回收菜单
