import random

fun = random.randint(0, 100)  # fun值随机化
name = ''
password = ''
auto_save_time = 300

# ----------------------数值初始化

HP = 100  # 生命
HP_MAX = 100
HV = 50  # 饥饿
HV_MAX = 50
EXP = 0  # 当前经验
EXP_MAX = 5  # 所需经验
BAG = 10  # 背包总量（kg
BAG_Used = 0  # 目前已用
LV = 1  # 等级
Buffer_LV = LV
coin = 0  # 钱
realm = '凡人'
realm_LV = 1
# ----------------------

BAG_List = {'五品金疮药': 5}
BAG_List_Buffer = {}

# ----------------------

head = '绷带'
body = '破布衣'
leg = '补丁裤'
foot = '草鞋'
hand = '拳头'

# ----------------------

AT = 0  # 攻击
DF = 0  # 防御值计算（利用字典

# ----------------------
ET = ['头部：' + str(head), '躯体：' + str(body), '腿部：' + str(leg), '脚部：' + str(foot), '手部：' + str(hand)]  # 装备总览

# ----------------------

PATSE = {'knife': ['狠狠地挥向', '不偏不倚地挥在了', '击中了', '在空中划过一道优美的弧线，落在了', '挥向', '砍在了', '横劈在'],
         'fist': ['抡向了', '击中了', '打在了', '两拳合拢，重重地砸在'], 'sword': ['挥向了', '刺向了', '截在', '的剑锋点在', '扫在了', '不偏不倚地刺中了']}
PATSE_1 = ['的头部！', '的肚子上！', '的小腿上！', '的胳膊上！', '的脖子上！']

# ----------------------

ZYC = ['突然窜了出来', '挡住了去路', '从天而降', '突然钻了出来', '从地面钻出来']
MATSE = ['咬住了', '夹住了', '冲向了', '撞在了', '用牙齿刺破了']
MATSE_1 = ['的头！', '的肚子！', '的小腿！', '的胳膊！', '的脖子！', '的手！']

# ------------------------
# 判断
if_sit = False
if_run = False
fi_enter = False
menpai_can = False

# -------------------------

shop_enter = 0  # 是否进入商店
inflation = 1  # 通货膨胀率

# -------------------------

poem_l = ['平明拂剑朝天去，薄暮垂鞭醉酒归。', '五陵年少金市东，银鞍白马度春风。', '感君恩重许君命，泰山一掷轻鸿毛。', '手中电曳倚天剑，直斩长鲸海水开。', '万里浮云卷碧山，青天中道流孤月。',
          '暂就东山赊月色，酣歌一夜送泉明。', '我醉欲眠卿且去，明朝有意抱琴来。', '一身转战三千里，一剑曾当百万师。', '弓背霞明剑照霜，秋风走马出咸阳。', '三尺青锋怀天下，一骑白马开吴疆。']
poem = random.choice(poem_l)

# -------------------------

w_time = 0

# -------------------------
# 地点
place_l = {'无': ['', '', '', ''], '中央广场': ['北大道', '东大道', '南大道', '西大道'], '北大道': ['北大道_1', '无', '中央广场', '无'],
           '北大道_1': ['北大道_2', '馒头铺', '北大道', '无'],
           '北大道_2': ['北大道_3', '熟食铺', '北大道_1', '小吃店'], '北大道_3': ['北门', '无', '北大道_2', '无'],
           '北门': ['树林', '无', '北大道_3', '无'], '树林': ['门派接待使者', '无', '北门', '无'],
           '东大道': ['无', '东大道_2', '无', '中央广场'], '熟食铺': ['无', '无', '无', '北大道_2'], '门派接待使者': ['无', '无', '树林', '无 ']}
place = '中央广场'

# ------------------------
# 门派
menpai = ''
menpai_list_kind = {'1': '华山剑宗', '2': '武当派', '3': '少林寺', '4': '峨眉派', '5': '昆仑派', '6': '崆峒派', '7': '恒山派', '8': '点苍派'}
menpai_list_neutral = {'1': '唐门', '2': '桃花岛', '3': '遮天宗', '4': '雪山宗', '5': '明教', '6': '丐帮'}
menpai_list_evil = {'1': '血刃门', '2': '日月神教', '3': '毒蛊宗'}

# ------------------------
# 音乐
Music_list = ['']
